Revit 2027 API
ThermalProperties.ThermalMass Property
 The calculated thermal mass value. The unit is kilogram feet-squared per second squared kelvin (kg ft^2/(s^2 K)).
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double ThermalMass { get; }
Public ReadOnly Property ThermalMass As Double
	Get
public:
property double ThermalMass {
	double get ();
}
member ThermalMass : float with get
Property Value
Double
See Also
Reference
ThermalProperties Class
Autodesk.Revit.DB Namespace